Revit 2026 API

# WireMaterialTypeSetReverseIterator Method

---

Retrieve a backward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual WireMaterialTypeSetIterator ReverseIterator()
```
```vb
Public Overridable Function ReverseIterator As WireMaterialTypeSetIterator
```
```cpp
public:
virtual WireMaterialTypeSetIterator^ ReverseIterator()
```
```fsharp
abstract ReverseIterator : unit -> WireMaterialTypeSetIterator
override ReverseIterator : unit -> WireMaterialTypeSetIterator
```

#### Return Value

WireMaterialTypeSetIteratorReturns a backward moving iterator to the set.

#### Reference

WireMaterialTypeSet Class

Autodesk.Revit.DB.Electrical Namespace